# Personal MacBook setup managed by ~/.config/install.sh.

tap "homebrew/bundle"

# Core shell and source-control tooling.
brew "bash"
brew "coreutils"
brew "direnv"
brew "git"
brew "git-lfs"
brew "gh"
brew "gnupg"
brew "pinentry-mac"

# Terminal/editor workflow.
brew "fd"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "tree-sitter"

# Language runtimes and dev tooling used by the checked-in configs.
brew "dotnet"
brew "erlang"
brew "go"
brew "llvm"
brew "lua-language-server"
brew "node"
brew "pnpm"
brew "python@3.14"
brew "rebar3"
brew "rust"
brew "zls"

# Project and platform CLIs currently used on this machine.
brew "docker"
brew "kubernetes-cli"
brew "postgresql@14"
brew "shopify-cli"
brew "stripe"

# AI CLIs.
brew "gemini-cli"
brew "opencode"
brew "pi-coding-agent"

# Window manager and explicitly requested apps.
cask "aerospace"
cask "helium-browser"
cask "iterm2"

# AI GUI/terminal casks currently installed on this machine.
cask "claude-code"
cask "codex"
cask "copilot-cli"
